output/R18000
Running 30s test @ http://172.17.0.1/index.html
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.811ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.124ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.91ms  829.55us  11.61ms   65.86%
    Req/Sec     9.45k     0.95k   13.78k    68.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.88ms
 75.000%    2.49ms
 90.000%    3.00ms
 99.000%    3.90ms
 99.900%    4.74ms
 99.990%    7.07ms
 99.999%   10.49ms
100.000%   11.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            1         1.00
       0.829     0.100000        35559         1.11
       1.151     0.200000        71181         1.25
       1.407     0.300000       106761         1.43
       1.645     0.400000       142334         1.67
       1.876     0.500000       177875         2.00
       1.990     0.550000       195537         2.22
       2.109     0.600000       213411         2.50
       2.231     0.650000       231283         2.86
       2.359     0.700000       249109         3.33
       2.491     0.750000       266647         4.00
       2.561     0.775000       275569         4.44
       2.637     0.800000       284520         5.00
       2.715     0.825000       293415         5.71
       2.799     0.850000       302292         6.67
       2.893     0.875000       311134         8.00
       2.945     0.887500       315578         8.89
       3.001     0.900000       320047        10.00
       3.061     0.912500       324504        11.43
       3.127     0.925000       328891        13.33
       3.201     0.937500       333362        16.00
       3.243     0.943750       335558        17.78
       3.291     0.950000       337785        20.00
       3.343     0.956250       339970        22.86
       3.401     0.962500       342165        26.67
       3.469     0.968750       344402        32.00
       3.509     0.971875       345523        35.56
       3.553     0.975000       346600        40.00
       3.603     0.978125       347732        45.71
       3.663     0.981250       348846        53.33
       3.727     0.984375       349933        64.00
       3.767     0.985938       350487        71.11
       3.809     0.987500       351043        80.00
       3.863     0.989062       351605        91.43
       3.919     0.990625       352156       106.67
       3.981     0.992188       352711       128.00
       4.019     0.992969       352993       142.22
       4.063     0.993750       353266       160.00
       4.103     0.994531       353552       182.86
       4.159     0.995313       353823       213.33
       4.211     0.996094       354101       256.00
       4.251     0.996484       354241       284.44
       4.287     0.996875       354383       320.00
       4.327     0.997266       354515       365.71
       4.379     0.997656       354660       426.67
       4.455     0.998047       354793       512.00
       4.495     0.998242       354863       568.89
       4.543     0.998437       354932       640.00
       4.603     0.998633       355003       731.43
       4.667     0.998828       355072       853.33
       4.751     0.999023       355141      1024.00
       4.799     0.999121       355173      1137.78
       4.879     0.999219       355208      1280.00
       4.963     0.999316       355244      1462.86
       5.075     0.999414       355277      1706.67
       5.275     0.999512       355312      2048.00
       5.367     0.999561       355329      2275.56
       5.519     0.999609       355347      2560.00
       5.683     0.999658       355364      2925.71
       5.787     0.999707       355381      3413.33
       5.939     0.999756       355399      4096.00
       6.019     0.999780       355408      4551.11
       6.187     0.999805       355418      5120.00
       6.275     0.999829       355425      5851.43
       6.535     0.999854       355434      6826.67
       6.879     0.999878       355442      8192.00
       6.991     0.999890       355447      9102.22
       7.263     0.999902       355451     10240.00
       7.479     0.999915       355455     11702.86
       7.683     0.999927       355459     13653.33
       7.867     0.999939       355464     16384.00
       8.019     0.999945       355466     18204.44
       8.335     0.999951       355468     20480.00
       8.503     0.999957       355470     23405.71
       8.767     0.999963       355472     27306.67
       9.263     0.999969       355476     32768.00
       9.263     0.999973       355476     36408.89
       9.375     0.999976       355477     40960.00
       9.583     0.999979       355478     46811.43
      10.015     0.999982       355479     54613.33
      10.223     0.999985       355480     65536.00
      10.487     0.999986       355481     72817.78
      10.487     0.999988       355481     81920.00
      10.567     0.999989       355482     93622.86
      10.567     0.999991       355482    109226.67
      10.879     0.999992       355483    131072.00
      10.879     0.999993       355483    145635.56
      10.879     0.999994       355483    163840.00
      10.959     0.999995       355484    187245.71
      10.959     0.999995       355484    218453.33
      10.959     0.999996       355484    262144.00
      10.959     0.999997       355484    291271.11
      10.959     0.999997       355484    327680.00
      11.615     0.999997       355485    374491.43
      11.615     1.000000       355485          inf
#[Mean    =        1.908, StdDeviation   =        0.830]
#[Max     =       11.608, Total count    =       355485]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  529707 requests in 30.00s, 429.37MB read
Requests/sec:  17656.48
Transfer/sec:     14.31MB